swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
/**************************************************************************//**
 * @file     rtl8735b_otp.c
 * @brief    This file implements the UART IP power, clock, baud rate
 *           configuration functions.
 * @version  V1.00
 * @date     2021-07-16
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2020 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/
#include "cmsis.h"
#include "rtl8735b.h"
#include "rtl8735b_otp.h"

#if CONFIG_OTP_EN

#define SECTION_OTP_TEXT           SECTION(".rom.hal_otp.text")
#define SECTION_OTP_DATA           SECTION(".rom.hal_otp.data")
#define SECTION_OTP_RODATA         SECTION(".rom.hal_otp.rodata")
#define SECTION_OTP_BSS            SECTION(".rom.hal_otp.bss")
#define SECTION_OTP_STUBS          SECTION(".rom.hal_otp.stubs")
/**
* @addtogroup hal_otp OTP
* @{
*/

/**
* @brief The global common data structure to store common resource
*        for all OTP adapters.
*/
SECTION_OTP_BSS hal_otp_adapter_t otp_adpt;

/**
* @brief The global common data structure to store common resource
*        for all OTP adapters.
*/
SECTION_OTP_BSS hal_otp_adapter_t *_potp_adpt;
//SECTION_OTP_BSS uint32_t    otp_wr_dly;
SECTION_OTP_BSS uint8_t     otp_adj_vol_lvl = 0xFF;
/**/
SECTION_OTP_BSS uint8_t     otp_op_to       = 100;

/// @cond DOXYGEN_ROM_HAL_API

/**
* @addtogroup hs_hal_uart_rom_func UART HAL ROM APIs.
* @ingroup hs_hal_uart
* @{
* @brief UART HAL ROM API. The user application(in RAM space) should not call these APIs directly.
*        There is another set of UART HAL APIs in the RAM space is provided for the user application.
*/

/**
* @brief The stubs functions table to exports OTP HAL functions in ROM.
*/
SECTION_OTP_STUBS const hal_otp_func_stubs_t hal_otp_stubs = {
	.ppotp_adapter                     = &_potp_adpt,
	.hal_otp_init                  = hal_rtl_otp_init,
	.hal_otp_deinit                = hal_rtl_otp_deinit,
	.hal_otp_ctrl_sel              = hal_rtl_otp_ctrl_sel,
	.hal_otp_ctrl_sel_sts          = hal_rtl_otp_ctrl_sel_sts,
	.hal_otp_pmc_gnt_ctrl          = hal_rtl_otp_pmc_gnt_ctrl,
	.hal_otp_wr_gnt_ctrl           = hal_rtl_otp_wr_gnt_ctrl,
	.hal_otpc_ctrl                 = hal_rtl_otpc_ctrl,
	.hal_otp_pwr_ctrl              = hal_rtl_otp_pwr_ctrl,
	.hal_otp_test_mod_cfg          = hal_rtl_otp_test_mod_cfg,
	.hal_otp_test_row_ctrl         = hal_rtl_otp_test_row_ctrl,
	.hal_otp_chk_err_sts           = hal_rtl_otp_chk_err_sts,
	.hal_otp_dsb_ctrl              = hal_rtl_otp_dsb_ctrl,
	.hal_otp_rb_ctrl               = hal_rtl_otp_rb_ctrl,
	.hal_otp_cz_ctrl               = hal_rtl_otp_cz_ctrl,
	.hal_otp_chk_cz_sts            = hal_rtl_otp_chk_cz_sts,
	.hal_otp_clr_cz_sts            = hal_rtl_otp_clr_cz_sts,
	.hal_otp_prct_ctrl             = hal_rtl_otp_prct_ctrl,
	.hal_otp_chk_prct_sts          = hal_rtl_otp_chk_prct_sts,
	.hal_otp_rd_lz_er_addr         = hal_rtl_otp_rd_lz_er_addr,
	.hal_otp_clr_prct_sts          = hal_rtl_otp_clr_prct_sts,
	.hal_otp_rd_sz_prct_sts        = hal_rtl_otp_rd_sz_prct_sts,
	.hal_otp_clr_sz_prct_sts       = hal_rtl_otp_clr_sz_prct_sts,
	.hal_otp_rd_ssz_prct_sts       = hal_rtl_otp_rd_ssz_prct_sts,
	.hal_otp_clr_ssz_prct_sts      = hal_rtl_otp_clr_ssz_prct_sts,
	.hal_otp_szwl_ctrl             = hal_rtl_otp_szwl_ctrl,
	.hal_otp_rd_aldn_sts           = hal_rtl_otp_rd_aldn_sts,
	.hal_otp_clr_aldn_sts          = hal_rtl_otp_clr_aldn_sts,
	.hal_otp_rd_al_sts             = hal_rtl_otp_rd_al_sts,
	.hal_otp_clr_al_sts            = hal_rtl_otp_clr_al_sts,
	.hal_otp_al_cfg                = hal_rtl_otp_al_cfg,
	.hal_otp_al_ctrl_aon           = hal_rtl_otp_al_ctrl_aon,
	.hal_otp_bust_ctrl             = hal_rtl_otp_bust_ctrl,
	.hal_otp_rd_sub_aon            = hal_rtl_otp_rd_sub_aon,
	.hal_otp_rd_aon                = hal_rtl_otp_rd_aon,
	.hal_otp_byte_rd_aon           = hal_rtl_otp_byte_rd_aon,
	.hal_otp_wr_sub_aon            = hal_rtl_otp_wr_sub_aon,
	.hal_otp_wr_aon                = hal_rtl_otp_wr_aon,
	.hal_otp_byte_wr_aon           = hal_rtl_otp_byte_wr_aon,
	.hal_otp_cmp_aon               = hal_rtl_otp_cmp_aon,
	.hal_otp_rd_sub_sys            = hal_rtl_otp_rd_sub_sys,
	.hal_otp_rd_sys                = hal_rtl_otp_rd_sys,
	.hal_otp_byte_rd_sys           = hal_rtl_otp_byte_rd_sys,
	.hal_otp_wr_sub_sys            = hal_rtl_otp_wr_sub_sys,
	.hal_otp_wr_sys                = hal_rtl_otp_wr_sys,
	.hal_otp_byte_wr_sys           = hal_rtl_otp_byte_wr_sys,
	.hal_otp_cmp_sys               = hal_rtl_otp_cmp_sys,
	.hal_otp_al_ctrl_sys           = hal_rtl_otp_al_ctrl_sys,
	.hal_otp_rd_sub_syss           = hal_rtl_otp_rd_sub_syss,
	.hal_otp_rd_syss               = hal_rtl_otp_rd_syss,
	.hal_otp_byte_rd_syss          = hal_rtl_otp_byte_rd_syss,
	.hal_otp_wr_sub_syss           = hal_rtl_otp_wr_sub_syss,
	.hal_otp_wr_syss               = hal_rtl_otp_wr_syss,
	.hal_otp_byte_wr_syss          = hal_rtl_otp_byte_wr_syss,
	.hal_otp_cmp_syss              = hal_rtl_otp_cmp_syss,
	.hal_otp_al_ctrl_syss          = hal_rtl_otp_al_ctrl_syss,
	.hal_otp_byte_wr_marr_aon      = hal_rtl_otp_byte_wr_marr_aon,
	.hal_otp_byte_wr_marr_sys      = hal_rtl_otp_byte_wr_marr_sys,
	.hal_otp_byte_wr_marr_syss     = hal_rtl_otp_byte_wr_marr_syss,
	.hal_otp_adj_vol_lvl           = &otp_adj_vol_lvl,
	.hal_otp_rp_mar_rd_syss        = hal_rtl_otp_rp_mar_rd_syss,
	.hal_otp_rp_chk_syss           = hal_rtl_otp_rp_chk_syss,
	.hal_otp_rp_pg_syss            = hal_rtl_otp_rp_pg_syss,
	.hal_otp_set_aon_vol           = hal_rtl_otp_set_aon_vol,
};

/**
*  @brief Description of hal_rtl_otp_init
*         hal_rtl_otp_init is used to do OTP parameter initialization
*
*  @param[in]  void
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_init(void)
{
	DBG_OTP_INFO("otp init-> adpt addr: %08x, padpt addr: %08x\n", &otp_adpt, &_potp_adpt);
	_potp_adpt = &otp_adpt;
	_potp_adpt->slpc_en_dly = OTP_DEFAULT_SLPCEN_DLY;
	_potp_adpt->pc_en_dly   = OTP_DEFAULT_PCEN_DLY;
	_potp_adpt->wr_dly      = OTP_DEFAULT_WR_DLY;
	_potp_adpt->rd_dly      = OTP_DEFAULT_RD_DLY;
	otp_adj_vol_lvl = 0x04;
}

/**
*  @brief Description of hal_rtl_otp_deinit
*         hal_rtl_otp_deinit is used to do OTP parameter de-initialization
*
*  @param[in]  void
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_deinit(void)
{
	DBG_OTP_INFO("otp deinit-> adpt addr: %08x, padpt addr: %08x\n", &otp_adpt, &_potp_adpt);
	_potp_adpt->slpc_en_dly = (uint32_t)NULL;
	_potp_adpt->pc_en_dly   = (uint32_t)NULL;
	_potp_adpt->wr_dly      = (uint32_t)NULL;
	_potp_adpt->rd_dly      = (uint32_t)NULL;
	_potp_adpt = (hal_otp_adapter_t *)NULL;
	otp_adj_vol_lvl = 0xFF;
}

/**
*  @brief Description of hal_rtl_otp_ctrl_sel
*         hal_rtl_otp_ctrl_sel is used to select OTP access control source
*
*  @param[in]  uint8_t otp_ctrl_sel: select AON/SYSON control source
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_ctrl_sel(uint8_t otp_ctrl_sel)
{
	uint32_t reg_tmp = 0;

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_SYS_CTRL)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_RW_REG_SEL);
	HAL_SET_BIT(reg_tmp, otp_ctrl_sel << AON_SHIFT_OTP_RW_REG_SEL);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_SYS_CTRL)), reg_tmp);
}

/**
*  @brief Description of hal_rtl_otp_ctrl_sel_sts
*         hal_rtl_otp_ctrl_sel_sts is used to show current selection of control source
*
*  @param[in]  void
*
*  @returns uint8_t curent selection of control sourcee
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_ctrl_sel_sts(void)
{
	uint32_t reg_tmp = 0;

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_SYS_CTRL)));
	reg_tmp = ((reg_tmp & AON_BIT_OTP_RW_REG_SEL) >> AON_SHIFT_OTP_RW_REG_SEL);
	return reg_tmp;
}

/**
*  @brief Description of hal_rtl_otp_pmc_gnt_ctrl
*         hal_rtl_otp_pmc_gnt_ctrl is used to control power control grant enable/disable
*
*  @param[in]  uint8_t gnt_en: power control grant control
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_pmc_gnt_ctrl(uint8_t gnt_en)
{
	uint32_t reg_tmp = 0;

	if (!gnt_en) {
		/* Clear grant bit after access power control */
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)));
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OPT_PWR_CTRL_GNT);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)), reg_tmp);
	} else {
		/* Set grant bit before access power control */
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)));
		HAL_SET_BIT(reg_tmp, AON_BIT_OPT_PWR_CTRL_GNT);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)), reg_tmp);;
	}

	DBG_OTP_INFO("c gnt reg(%x): %08x\n", (AON_BASE + (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL))),
				 HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL))));
}

/**
*  @brief Description of hal_rtl_otp_wr_gnt_ctrl
*         hal_rtl_otp_wr_gnt_ctrl is used to control write grant enable/disable
*
*  @param[in]  uint8_t gnt_en: write grant control
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_wr_gnt_ctrl(uint8_t gnt_en)
{
	uint32_t reg_tmp = 0;

	if (!gnt_en) {
		/* Clear grant bit after access power control */
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)));
		HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_BURN_GNT);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)), reg_tmp);
	} else {
		/* Set grant bit before access power control */
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)));
		HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_BURN_GNT);
		HAL_SET_BIT(reg_tmp, OTP_WR_GRNT_CODE);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)), reg_tmp);
	}

	DBG_OTP_INFO("wr gnt reg(%x): %08x\n", (AON_BASE + (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL))),
				 HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL))));
}

/**
*  @brief Description of hal_rtl_otpc_ctrl
*         hal_rtl_otpc_ctrl is used to configure OTP controller and its read/write
*         clock.
*
*  @param[in]  uint8_t otpc_en: OTP controller enable
*  @param[in]  uint8_t wclk_en: write clock enable
*  @param[in]  uint8_t rclk_en: read clock enable
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otpc_ctrl(uint8_t otpc_en, uint8_t wclk_en, uint8_t rclk_en)
{
	uint32_t reg_tmp = 0;
	uint32_t pwr_ctrl_bak;
	/* Check and backup PMC grant status */
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PMC_DBG_CTRL)));
	pwr_ctrl_bak = HAL_READ_BIT(reg_tmp, AON_BIT_OPT_PWR_CTRL_GNT);
	if (pwr_ctrl_bak == 0) {
		DBG_OTP_WARN("enable pwr gnt\n");
		hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);
	}

	/* Configure clock first */
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)));
	if (wclk_en) {
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_PGCLK_GT_EN);
	} else {
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_PGCLK_GT_EN);
	}

	if (rclk_en) {
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_RDCLK_GT_EN);
	} else {
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDCLK_GT_EN);
	}

	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
	DBG_OTP_INFO("pwr ctrl(1)(%x): %08x\n", (AON_BASE + (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL))),
				 HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL))));
	/* Configure controller */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	if (!otpc_en) {
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_CTRLER_FEN);
	} else {
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_CTRLER_FEN);
	}

	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
	DBG_OTP_INFO("pwr ctrl(2)(%x): %08x\n", (AON_BASE + (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL))),
				 HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL))));
#else
	uint8_t rma_sts;
	rma_sts = hal_rtl_sys_get_rma_state();
	if (RMA_NORMAL_STATE == rma_sts) {
		if (!otpc_en) {
			HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_CTRLER_FEN);
		} else {
			HAL_SET_BIT(reg_tmp, AON_BIT_OTP_CTRLER_FEN);
		}

		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
		DBG_OTP_INFO("pwr ctrl(2)(%x): %08x\n", (AON_BASE + (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL))),
					 HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL))));
	} else {
		if (!otpc_en) {
			DBG_OTP_WARN("Try to disable controller in RMA state\n");
		}
	}

#endif
	if (pwr_ctrl_bak == 0) {
		DBG_OTP_WARN("disable pwr gnt\n");
		hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);
	}
}

/**
*  @brief Description of hal_rtl_otp_pwr_ctrl
*         hal_rtl_otp_pwr_ctrl is used to enable/disable OTP power control
*
*  @param[in]  uint8_t pwr_en: OTP power control
*
*  @returns uint32_t: power control result
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_pwr_ctrl(uint8_t pwr_en)
{
	uint32_t reg_tmp = 0;
	uint32_t ret_sts = 0;

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)));
	if (!pwr_en) {
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_ISO2AON_EN);
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_ISO2PON_EN);
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_ISO2SYSON_EN);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_PC_SL_EN);
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_PC_BG_EN);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
	} else {
		/* Enable small PC first */
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_PC_SL_EN);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
		hal_delay_us(_potp_adpt->slpc_en_dly);
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_PC_BG_EN);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_ISO2AON_EN);
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_ISO2PON_EN);
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_ISO2SYSON_EN);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)), reg_tmp);
	}

