swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	ret_sts = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PWR_CTRL)));

	return ret_sts;
}

/**
*  @brief Description of hal_rtl_otp_test_mod_cfg
*         hal_rtl_otp_test_mod_cfg is used to configure OTP test mode selection register
*
*  @param[in]  uint8_t test_mod: OTP test mode
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_test_mod_cfg(uint8_t test_mod)
{
	uint32_t reg_tmp = 0;

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)));
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_TEST_SEL);
	HAL_SET_BIT(reg_tmp, ((test_mod & OTP_TEST_MOD_MSK) << AON_SHIFT_OTP_TEST_SEL));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)), reg_tmp);

	DBG_OTP_INFO("Test Mode Cfg: %x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0))));
}

/**
*  @brief Description of hal_rtl_otp_test_row_ctrl
*         hal_rtl_otp_test_row_ctrl is used to enable/disable test row access
*
*  @param[in]  uint8_t test_row_en: test row enable control
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_test_row_ctrl(uint8_t test_row_en)
{
	uint32_t reg_tmp = 0;

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_TROW_EN);
	HAL_SET_BIT(reg_tmp, ((test_row_en & OTP_TEST_ROW_MSK) << AON_SHIFT_OTP_TROW_EN));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)), reg_tmp);
}

/**
*  @brief Description of hal_rtl_otp_chk_err_sts
*         hal_rtl_otp_chk_err_sts is used to check error status
*
*  @param[in]  void
*
*  @returns uint32_t: OTP error flag
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_chk_err_sts(void)
{
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)));
	ret_val = (reg_tmp & AON_BIT_OTP_ERR_FLAG) >> AON_SHIFT_OTP_ERR_FLAG;

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_dsb_ctrl
*         hal_rtl_otp_dsb_ctrl is used to control DSB enable
*
*  @param[in]  uint8_t dsb_en: OTP DSB control
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_dsb_ctrl(uint8_t dsb_en)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_DSB_EN);
	HAL_SET_BIT(reg_tmp, ((dsb_en & OTP_DSB_EN_MSK) << AON_SHIFT_OTP_DSB_EN));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)), reg_tmp);
}

/**
*  @brief Description of hal_rtl_otp_rb_ctrl
*         hal_rtl_otp_rb_ctrl is used to control reboot(PTRIM) enable/disable
*
*  @param[in]  uint8_t rb_en: reboot operaton enable/disable after repair program
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_rb_ctrl(uint8_t rb_en)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_1)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_RB_CTRL);
	HAL_SET_BIT(reg_tmp, ((rb_en & OTP_RB_EN_MSK) << AON_SHIFT_OTP_RB_CTRL));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_1)), reg_tmp);
}

/**
*  @brief Description of hal_rtl_otp_cz_ctrl
*         hal_rtl_otp_cz_ctrl is used to configure counting zero control
*
*  @param[in]  uint8_t cz_en: OTP counting zero enable/disable
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_cz_ctrl(uint8_t cz_en)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_B_OTP_CNTZ_CTRL);
	HAL_SET_BIT(reg_tmp, ((cz_en & OTP_CZ_EN_MSK) << AON_SHIFT_B_OTP_CNTZ_CTRL));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)), reg_tmp);
}

/**
*  @brief Description of hal_rtl_otp_chk_cz_sts
*         hal_rtl_otp_chk_cz_sts is used to grep CZ status according to a given key selection
*
*  @param[in]  uint32_t key_sel: if key_sel is 0xFFFFFFFF, return the whole register
*
*  @returns uint32_t: CZ status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_chk_cz_sts(uint32_t key_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)));

	if (key_sel == OTP_CZ_STS_ALL) {
		return reg_tmp;
	} else {
		reg_tmp &= (0x01 << key_sel);
		reg_tmp = reg_tmp >> key_sel;
		return reg_tmp;
	}
}

/**
*  @brief Description of hal_rtl_otp_clr_cz_sts
*         hal_rtl_otp_clr_cz_sts is used to clear CZ status register and return value after clearing
*
*  @param[in]  uint32_t key_sel: if key_sel is 0xFFFFFFFF, return the whole register
*
*  @returns uint32_t:¡@CZ status after clearing
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_clr_cz_sts(uint32_t key_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)));

	if (key_sel == OTP_CZ_STS_ALL) {
		reg_tmp = OTP_CZ_STS_ALL;
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)), reg_tmp);
		return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)));
	} else {
		reg_tmp |= (OTP_CZ_EN_MSK << key_sel);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)), reg_tmp);
		return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_OTP_CNT_Z_CTRL)));
	}
}

/**
*  @brief Description of hal_rtl_otp_prct_ctrl
*         hal_rtl_otp_prct_ctrl is used to configure OTP protect control and return the status
*
*  @param[in]  uint8_t prct_en: protectoin control enable/disable
*
*  @returns uint32_t: protection control status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_prct_ctrl(uint8_t prct_en)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_B_OTP_PRCT_CTRL);
	HAL_SET_BIT(reg_tmp, ((prct_en & OTP_PRCT_EN_MSK) << AON_SHIFT_B_OTP_PRCT_CTRL));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)), reg_tmp);

	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
}

/**
*  @brief Description of hal_rtl_otp_chk_prct_sts
*         hal_rtl_otp_chk_prct_sts is used to check protect status according to a given selection.
*
*  @param[in]  uint32_t pwr_en: protection selection
*
*  @returns uint32_t: protection status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_chk_prct_sts(uint32_t prct_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));

