swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	if (prct_sel == OTP_PRCT_STS_ALL) {
		return reg_tmp;
	} else {
		reg_tmp &= (0x01 << prct_sel);
		reg_tmp = reg_tmp >> prct_sel;
		return reg_tmp;
	}
}

/**
*  @brief Description of hal_rtl_otp_rd_lz_er_addr
*         hal_rtl_otp_rd_lz_er_addr is used to read logical zone CRC error address
*         which is start address of a entry
*
*  @param[in]  void
*
*  @returns uint32_t: logical zone CRC error address
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_lz_er_addr(void)
{
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));

	ret_val = (reg_tmp & AON_MASK_B_OTP_LZ_CRC_ER_ADDR) >> AON_SHIFT_B_OTP_LZ_CRC_ER_ADDR;
	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_clr_prct_sts
*         hal_rtl_otp_clr_prct_sts is used to clear protect status according to a given selection
*         and return result after clear
*
*  @param[in]  uint32_t pwr_en: protection selection, 0xFFFFFFFF is to clear all
*
*  @returns uint32_t protection status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_clr_prct_sts(uint32_t prct_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));

	if (prct_sel == OTP_PRCT_STS_ALL) {
		reg_tmp = OTP_CZ_STS_ALL;
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)), reg_tmp);
		return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	} else {
		reg_tmp |= (OTP_PRCT_EN_MSK << prct_sel);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)), reg_tmp);
		return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	}
}

/**
*  @brief Description of hal_rtl_otp_rd_sz_prct_sts
*         hal_rtl_otp_rd_sz_prct_sts is used to read secure zone key protection status (CRC)
*
*  @param[in]  void
*
*  @returns uint32_t: protection status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_sz_prct_sts(void)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	reg_tmp &= AON_MASK_B_OTP_SZ_CRC_STS;
	reg_tmp = reg_tmp >> AON_SHIFT_B_OTP_SZ_CRC_STS;
	return reg_tmp;
}

/**
*  @brief Description of hal_rtl_otp_clr_sz_prct_sts
*         hal_rtl_otp_clr_sz_prct_sts is used to clear secure zone protection status
*
*  @param[in]  uint8_t sz_prct_sts_sel: secure zone protection status selection
*
*  @returns uint32_t:   secure zone protecion status after clearing
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_clr_sz_prct_sts(uint32_t sz_prct_sts_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	reg_tmp |= OTP_PRCT_EN_MSK << (sz_prct_sts_sel);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)), reg_tmp);
	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
}

/**
*  @brief Description of hal_rtl_otp_rd_ssz_prct_sts
*         hal_rtl_otp_rd_ssz_prct_sts is used to read super secure zone key protection status (CRC)
*
*  @param[in]  void
*
*  @returns uint32_t:   super secure zone status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_ssz_prct_sts(void)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	reg_tmp &= AON_MASK_B_OTP_SSZ_CRC_STS;
	reg_tmp = reg_tmp >> AON_SHIFT_B_OTP_SSZ_CRC_STS;
	return reg_tmp;
}

/**
*  @brief Description of hal_rtl_otp_clr_ssz_prct_sts
*         hal_rtl_otp_clr_ssz_prct_sts is used to clear super secure zone status
*
*  @param[in]  uint32_t ssz_prct_sts_sel: secure zone protection status selection
*
*  @returns uint32_t: super secure zone protection status after clearing
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_clr_ssz_prct_sts(uint32_t ssz_prct_sts_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	reg_tmp |= OTP_PRCT_EN_MSK << (ssz_prct_sts_sel);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)), reg_tmp);
	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
}

/**
*  @brief Description of hal_rtl_otp_szwl_ctrl
*         hal_rtl_otp_szwl_ctrl is used to configure secure zone write lock function
*
*  @param[in]  uint32_t sz_wl_en: enable/disable secure zone write lock function
*                                 1: enable, 0: disable
*
*  @returns uint32_t: protection control regsiter
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_szwl_ctrl(uint32_t sz_wl_en)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_B_OTP_SZ_WL_CTRL);
	HAL_SET_BIT(reg_tmp, ((sz_wl_en & OTP_PRCT_SZ_WL_MSK) << AON_SHIFT_B_OTP_SZ_WL_CTRL));
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)), reg_tmp);

	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_PRCT_CTRL)));
}


/**
*  @brief Description of hal_rtl_otp_rd_aldn_sts
*         hal_rtl_otp_rd_aldn_sts is used to read autoload done status according to a given selection
*
*  @param[in]  uint32_t aldn_sts_sel: autoload done status selection
*
*  @returns uint32_t: autoload done status bit
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_aldn_sts(uint32_t aldn_sts_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	reg_tmp = ((reg_tmp & (OTP_ALDN_STS_MSK << aldn_sts_sel)) >> aldn_sts_sel);
	return reg_tmp;
}

/**
*  @brief Description of hal_rtl_otp_clr_aldn_sts
*         hal_rtl_otp_clr_aldn_sts is used to clear autoload done status according to a given selection
*
*  @param[in]  uint32_t aldn_sts_sel: autoload done status selection
*
*  @returns uint32_t: autoload done status register
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_clr_aldn_sts(uint32_t aldn_sts_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	if (aldn_sts_sel == OTPAlSysonDnSts) {
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_ALDN_SYSON_STS);
	} else {
		reg_tmp |= (OTP_ALDN_STS_MSK << aldn_sts_sel);
	}

