swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)), reg_tmp);
	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
}

/**
*  @brief Description of hal_rtl_otp_rd_al_sts
*         hal_rtl_otp_rd_al_sts is used to read autoload status(pass/failed) according to a given selection
*
*  @param[in]  uint32_t al_sts_sel: autoload status selection
*
*  @returns uint32_t: autoload status bit
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_al_sts(uint32_t al_sts_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	reg_tmp = ((reg_tmp & (OTP_AL_STS_MSK << al_sts_sel)) >> al_sts_sel);
	return reg_tmp;
}

/**
*  @brief Description of hal_rtl_otp_clr_al_sts
*         hal_rtl_otp_clr_al_sts is used to clear autoload status(pass/failed) according to a given selection
*
*  @param[in]  uint32_t al_sts_sel: autoload status selection
*
*  @returns uint32_t: autoload status register
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_clr_al_sts(uint32_t al_sts_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	if (al_sts_sel == OTPAlSysonSts) {
		HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_AL_SYSON_STS);
	} else {
		reg_tmp |= OTP_AL_STS_MSK << al_sts_sel;
	}

	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)), reg_tmp);
	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
}

/**
*  @brief Description of hal_rtl_otp_al_cfg
*         hal_rtl_otp_al_cfg is used to configure autoload enable according to a given selection
*
*  @param[in]  uint32_t al_trg_sel: autoload target selection
*
*  @returns uint32_t: autoload status regsiter
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_al_cfg(uint32_t al_trg_sel)
{
	uint32_t reg_tmp = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	HAL_CLEAR_BIT(reg_tmp, (AON_BIT_OTP_AL_AON_EN | AON_BIT_OTP_AL_PON_EN | AON_BIT_OTP_AL_SYSON_EN));
	HAL_SET_BIT(reg_tmp, al_trg_sel << AON_SHIFT_OTP_AL_AON_EN);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)), reg_tmp);
	return HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
}

/**
*  @brief Description of hal_rtl_otp_al_ctrl_aon
*         hal_rtl_otp_al_ctrl_aon is used to control autoload enable/disable flow by AON
*
*  @param[in]  uint32_t al_en: autoload enable
*
*  @returns uint32_t: autoload flow succeeded(0) or failed(OTP_RET_FAIL_FLG)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_al_ctrl_aon(uint32_t al_en)
{
	uint8_t as_ctrl_sel_bak;
	uint32_t reg_tmp = 0;
	uint32_t to_cnt = 0;
	uint32_t al_cfg;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = 0;

	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);

	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);

	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();
	/* change access control to AON */
	hal_rtl_otp_ctrl_sel(OTPCtrlAon);

	DBG_OTP_INFO("al_sts before enable: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS))));
	/* set mode first */
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_ADDR);
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_DATA);
	HAL_SET_BIT(reg_tmp, (OTPALEnMod << AON_SHIFT_OTP_MODE_SEL));
	/* clear ready bit first */
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDY);
	DBG_OTP_INFO("chk AS_A: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A))));
	DBG_OTP_INFO("wr to AS_A: %08x\n", reg_tmp);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);

	/* enable autoload operation */
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_RDY);
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_OP_EN);
	DBG_OTP_INFO("wr to AS_A: %08x\n", reg_tmp);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);

	to_cnt = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	DBG_OTP_INFO("AL_STS: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS))));
	al_cfg = (reg_tmp & (AON_BIT_OTP_AL_AON_EN | AON_BIT_OTP_AL_PON_EN | AON_BIT_OTP_AL_SYSON_EN));
	/* wait for autoload done */
	while (((reg_tmp & (al_cfg << AON_SHIFT_OTP_ALDN_AON_STS)) == 0) && (to_cnt < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
		DBG_OTP_INFO("AL_STS(%d): %08x\r\n", to_cnt, reg_tmp);
		to_cnt++;
	}

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDY);
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_OP_EN);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);

	if (to_cnt == OTP_RW_TO_CNT) {
		DBG_OTP_ERR("timeout!!!\n");
		to_cnt = OTP_RET_FAIL_FLG;
	} else {
		to_cnt = OTPStsSuccess;
	}

	/* restore access control selection */
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* In test chip, disable pwoer cut first then disable conroller,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(OTP_DEFAULT_PCEN_DLY);

	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
#else
	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#endif

