swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);
	return to_cnt;
}

/**
*  @brief Description of hal_rtl_otp_bust_ctrl
*         hal_rtl_otp_bust_ctrl is used to control burst operatoin enable/disable
*
*  @param[in]  uint8_t bust_en: burst enable
*
*  @returns uint32_t: operation succeeded(0) or failed(OTP_RET_FAIL_FLG)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_bust_ctrl(uint8_t bust_en)
{
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)));
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_BURST);
	HAL_SET_BIT(reg_tmp, (bust_en & OTP_BUST_EN_MSK) << AON_SHIFT_OTP_BURST);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_CTRL_0)), reg_tmp);

	if (bust_en == OTP_DISABLE) {
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		/* wait for operation done */
		while ((HAL_READ_BIT(reg_tmp, AON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
			hal_delay_us(OTP_RD_CHK_INTV);
			reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
			ret_val++;
		}

		if (ret_val == OTP_RW_TO_CNT) {
			ret_val = OTP_RET_FAIL_FLG;
		} else {
			ret_val = OTPStsSuccess;
		}
	}

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_rd_sub_aon
*         hal_rtl_otp_rd_sub_aon is used for read sub looping function by AON
*
*  @param[in]  uint8_t pwr_cl_en: power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *rd_data:  read data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: read status, succeeded(0), failed(OTP_RET_FAIL_FLG and failed data number)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_sub_aon(uint8_t pwr_cl_en, uint32_t addr, uint8_t *rd_data, uint16_t len)
{
	uint32_t rd_cnt = 0;
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;

	for (rd_cnt = 0; rd_cnt < len; rd_cnt++) {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if ((pwr_cl_en != 0) || (rd_cnt == 0)) {
			DBG_OTP_INFO("enable power\n");
			/* Enable OTP memory power */
			hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif
		/* set mode/addr first */
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_MODE_SEL);
		HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_ADDR);
		HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_DATA);
		HAL_SET_BIT(reg_tmp, (OTPRdMod << AON_SHIFT_OTP_MODE_SEL));
		HAL_SET_BIT(reg_tmp, (((addr + rd_cnt)& OTP_ADDR_MSK) << AON_SHIFT_OTP_ADDR));
		/* clear ready bit first */
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDY);
		DBG_OTP_INFO("to write AS_CTRL_A: %08x\n", reg_tmp);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);
		/* enable read operation */
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_RDY);
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_OP_EN);
		DBG_OTP_INFO("to write AS_CTRL_A: %08x\n", reg_tmp);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);

		ret_val = 0;
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		/* wait for operation done */
		while ((HAL_READ_BIT(reg_tmp, AON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
			hal_delay_us(OTP_RD_CHK_INTV);
			reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
			DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
			ret_val++;
		}

		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		*(rd_data + rd_cnt) = reg_tmp & AON_MASK_OTP_DATA;
		HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDY);
		HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_OP_EN);
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);

		if (ret_val == OTP_RW_TO_CNT) {
			DBG_OTP_ERR("TO.(%d)\n", rd_cnt);
			ret_val = OTP_RET_FAIL_FLG;
			ret_val |= rd_cnt;
		} else {
			ret_val = OTPStsSuccess;
		}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
		/* Disable power cut */
		if ((pwr_cl_en != 0) || (rd_cnt == len - 1) || ((ret_val & OTP_RET_FAIL_FLG) != OTPStsSuccess)) {
			/* Disable OTP memory power */
			DBG_OTP_INFO("disable power\n");
			hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif

		if ((ret_val & OTP_RET_FAIL_FLG) != 0) {
			break;
		}
	}

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_rd_aon
*         hal_rtl_otp_rd_aon is used for read function by AON
*
*  @param[in]  uint8_t pwr_cl_en: in test chip, power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*                                 in MP chip, this param is used to control disable power and controller after read process finished.
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *rd_data:  read data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: read status, succeeded(0), failed(OTP_RET_FAIL_FLG and failed data number)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_aon(uint8_t pwr_cl_en, uint32_t addr, uint8_t *rd_data, uint16_t len)
{
	uint8_t as_ctrl_sel_bak;
	uint32_t ret_val = 0;

	DBG_OTP_INFO("%s>\n", __func__);
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);

	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_ctrl_sel(OTPCtrlAon);
	/* to do read operation*/
	ret_val = hal_rtl_otp_rd_sub_aon(pwr_cl_en, addr, rd_data, len);

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* In test chip, disable power cut first then disable conroller,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);
#else
	if (OTP_ENABLE == pwr_cl_en) {
		/* Disable controller */
		hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

		/* Disable OTP memory power */
		DBG_OTP_INFO("disable power\n");
		hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
		hal_delay_us(_potp_adpt->pc_en_dly);

