swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	/* clear ready, compare result */
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_COMP_RESULT);
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDY);
	DBG_OTP_INFO("to write AS_CTRL_A -1: %08x\n", reg_tmp);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);

	/* set address, data, mode */
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_COMP_RESULT);
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_RDY);
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_ADDR);
	HAL_CLEAR_BIT(reg_tmp, AON_MASK_OTP_DATA);

	HAL_SET_BIT(reg_tmp, (OTPCmpMod << AON_SHIFT_OTP_MODE_SEL));
	HAL_SET_BIT(reg_tmp, ((addr & OTP_ADDR_MSK) << AON_SHIFT_OTP_ADDR));
	HAL_SET_BIT(reg_tmp, (cmp_data << AON_SHIFT_OTP_DATA));

	DBG_OTP_INFO("to write AS_CTRL_A -2: %08x\n", reg_tmp);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);
	DBG_OTP_INFO("after write AS_CTRL_A -2: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A))));
	/* enable compare operation */
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_OP_EN);
	DBG_OTP_INFO("to write AS_CTRL_A -3: %08x\n", reg_tmp);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);
	hal_delay_us(_potp_adpt->rd_dly);
	DBG_OTP_INFO("after write AS_CTRL_A -3: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A))));

	ret_val = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	/* wait for operation done */
	while ((HAL_READ_BIT(reg_tmp, AON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		ret_val++;
	}

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	DBG_OTP_INFO("as_ctrl after ready: %08x\n", reg_tmp);
	reg_tmp = HAL_READ_BIT(reg_tmp, AON_BIT_OTP_COMP_RESULT) >> AON_SHIFT_OTP_COMP_RESULT;

	if (ret_val == OTP_RW_TO_CNT) {
		DBG_OTP_INFO("timeout\n");
		ret_val = OTP_RET_FAIL_FLG;
	} else {
		ret_val = reg_tmp;
	}

	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_RDY);
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_COMP_RESULT);
	HAL_CLEAR_BIT(reg_tmp, AON_BIT_OTP_OP_EN);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);
#if 0
	/* clear compare result anyway */
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_COMP_RESULT);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);
#endif

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
	DBG_OTP_INFO("disable power\n");
	/* Disable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
#else
	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#endif

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);
	return ret_val;
}


/**
*  @brief Description of hal_rtl_otp_rd_sub_sys
*         hal_rtl_otp_rd_sub_sys is used for read sub looping function by SYSON
*
*  @param[in]  uint8_t pwr_cl_en: power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *rd_data:  read data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: read status, succeeded(0), failed(OTP_RET_FAIL_FLG and failed data number)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_sub_sys(uint8_t pwr_cl_en, uint32_t addr, uint8_t *rd_data, uint16_t len)
{
	uint32_t rd_cnt = 0;
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;

	for (rd_cnt = 0; rd_cnt < len; rd_cnt++) {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if ((pwr_cl_en != 0) || (rd_cnt == 0)) {
			DBG_OTP_INFO("enable power\n");
			/* Enable OTP memory power */
			hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif
		/* set mode/addr first */
		reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
		HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_MODE_SEL);
		HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_ADDR);
		HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_DATA);
		HAL_SET_BIT(reg_tmp, (OTPRdMod << SYSON_SHIFT_OTP_MODE_SEL));
		HAL_SET_BIT(reg_tmp, (((addr + rd_cnt)& OTP_ADDR_MSK) << SYSON_SHIFT_OTP_ADDR));
		/* clear ready bit first */
		HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
		DBG_OTP_INFO("to write AS_CTRL_NS: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);
		/* enable read operation */
		HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
		HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_OP_EN);
		DBG_OTP_INFO("to write AS_CTRL_NS: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);

		ret_val = 0;
		reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
		/* wait for operation done */
		while ((HAL_READ_BIT(reg_tmp, SYSON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
			hal_delay_us(OTP_RD_CHK_INTV);
			reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
			DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
			ret_val++;
		}

		reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
		*(rd_data + rd_cnt) = reg_tmp & SYSON_MASK_OTP_DATA;
		HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
		HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_OP_EN);
		HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);

		if (ret_val == OTP_RW_TO_CNT) {
			DBG_OTP_ERR("TO.(%d)\n", rd_cnt);
			ret_val = OTP_RET_FAIL_FLG;
			ret_val |= rd_cnt;
		} else {
			ret_val = OTPStsSuccess;
		}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
		/**/
		if ((pwr_cl_en != 0) || (rd_cnt == len - 1) || ((ret_val & OTP_RET_FAIL_FLG) != 0)) {
			/* Disable OTP memory power */
			DBG_OTP_INFO("disable power\n");
			hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif

		if ((ret_val & OTP_RET_FAIL_FLG) != 0) {
			break;
		}
	}

