swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif

	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();
	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	ret_val = hal_rtl_otp_wr_sub_sys(pwr_cl_en, addr, wr_data, len);

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);
#else
	if (OTP_ENABLE == pwr_cl_en) {
		/* Disable controller */
		hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

		/* Disable OTP memory power */
		DBG_OTP_INFO("disable power\n");
		hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
		hal_delay_us(_potp_adpt->pc_en_dly);

		/* Disable PMC control */
		hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);
	}
#endif
	DBG_OTP_INFO("%s<\n", __func__);
	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_byte_wr_sys
*         hal_rtl_otp_byte_wr_sys is used to do a one-byte write operation by SYSON
*
*  @param[in]  uint32_t addr: OTP memory address to be written
*  @param[in]  uint8_t wr_data: data to be written
*
*  @returns void
*/
SECTION_OTP_TEXT
void hal_rtl_otp_byte_wr_sys(uint32_t addr, uint8_t wr_data)
{
	hal_rtl_otp_wr_sys(OTP_ENABLE, addr, &wr_data, 1);
}

/**
*  @brief Description of hal_rtl_otp_cmp_sys
*         hal_rtl_otp_cmp_sys is used to do a comparison between given OTP memory address and data
*         by SYSON
*
*  @param[in]  uint32_t addr: OTP memory address which contains data to be compare with given data
*  @param[in]  uint32_t addr: given data to be compared with data of target OTP address
*
*  @returns uint32_t: comparison result, succeeded(0) failed(1)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_cmp_sys(uint32_t addr, uint8_t cmp_data)
{
	uint32_t reg_tmp = 0;
	uint8_t as_ctrl_sel_bak;
	uint32_t ret_val = 0;

	DBG_OTP_INFO("%s>\n", __func__);
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);
	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);

	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif

	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();
	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	/* set mode/addr/data first */
	reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));

	/* clear ready, compare result */
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_COMP_RESULT);
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
	DBG_OTP_INFO("to write AS_CTRL_SS -1: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);

	/* set address, data, mode */
	HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_COMP_RESULT);
	HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_ADDR);
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_DATA);

	HAL_SET_BIT(reg_tmp, (OTPCmpMod << SYSON_S_SHIFT_OTP_MODE_SEL));
	HAL_SET_BIT(reg_tmp, ((addr & OTP_ADDR_MSK) << SYSON_SHIFT_OTP_ADDR));
	HAL_SET_BIT(reg_tmp, (cmp_data << SYSON_SHIFT_OTP_DATA));

	DBG_OTP_INFO("to write AS_CTRL_S -2: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);
	DBG_OTP_INFO("after write AS_CTRL_S -2: %08x\n", HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS))));
	/* enable compare operation */
	HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
	DBG_OTP_INFO("to write AS_CTRL_SS -3: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);
	hal_delay_us(_potp_adpt->rd_dly);
	DBG_OTP_INFO("after write AS_CTRL_SS -3: %08x\n", HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS))));

	ret_val = 0;
	reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
	/* wait for operation done */
	while ((HAL_READ_BIT(reg_tmp, SYSON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
		ret_val++;
	}

	reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
	DBG_OTP_INFO("as_ctrl after ready: %08x\n", reg_tmp);
	reg_tmp = HAL_READ_BIT(reg_tmp, SYSON_BIT_OTP_COMP_RESULT) >> SYSON_SHIFT_OTP_COMP_RESULT;

	if (ret_val == OTP_RW_TO_CNT) {
		DBG_OTP_INFO("timeout\n");
		ret_val = OTP_RET_FAIL_FLG;
	} else {
		ret_val = reg_tmp;
	}

	reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_COMP_RESULT);
	HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_OP_EN);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);
#if 0
	/* clear compare result anyway */
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	HAL_SET_BIT(reg_tmp, AON_BIT_OTP_COMP_RESULT);
	HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)), reg_tmp);
#endif

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
	DBG_OTP_INFO("disable power\n");
	/* Disable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

