swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
#else
	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#endif

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);
	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_al_ctrl_sys
*         hal_rtl_otp_al_ctrl_sys is used to control autoload enable/disable flow by SYSON
*
*  @param[in]  uint32_t al_en: autoload enable
*
*  @returns uint32_t: autoload flow succeeded(0) or failed(OTP_RET_FAIL_FLG)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_al_ctrl_sys(uint32_t al_en)
{
	uint8_t as_ctrl_sel_bak;
	uint32_t reg_tmp = 0;
	uint32_t to_cnt = 0;
	uint32_t al_cfg;

	DBG_OTP_INFO("%s>\n", __func__);
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);

	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);

	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif

	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();
	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	DBG_OTP_INFO("al_sts before enable: %08x\n", HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS))));
	/* set mode first */
	reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_ADDR);
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_DATA);
	HAL_SET_BIT(reg_tmp, (OTPALEnMod << SYSON_SHIFT_OTP_MODE_SEL));
	/* clear ready bit first */
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
	DBG_OTP_INFO("chk AS_S: %08x\n", HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS))));
	DBG_OTP_INFO("wr to AS_S: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);
	/* enable autoload operation */
	HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_OP_EN);
	DBG_OTP_INFO("to write AS_CTRL_A: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);

	//hal_rtl_otp_ctrl_sel(OTPCtrlAon);
	to_cnt = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	DBG_OTP_INFO("AL_STS: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS))));
	al_cfg = (reg_tmp & (AON_BIT_OTP_AL_AON_EN | AON_BIT_OTP_AL_PON_EN | AON_BIT_OTP_AL_SYSON_EN));
	/* wait for autoload done */
	while (((reg_tmp & (al_cfg << AON_SHIFT_OTP_ALDN_AON_STS)) == 0) && (to_cnt < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
		DBG_OTP_INFO("AL_STS(%d): %08x\r\n", to_cnt, reg_tmp);
		to_cnt++;
	}

	//hal_rtl_otp_ctrl_sel(OTPCtrlSys);
	reg_tmp = HAL_READ32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)));
	HAL_SET_BIT(reg_tmp, SYSON_BIT_OTP_RDY);
	HAL_CLEAR_BIT(reg_tmp, SYSON_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, SYSON_BIT_OTP_OP_EN);
	HAL_WRITE32(SYSON_BASE, (uint32_t)(&(SYSON_BASE_REG->SYSON_REG_OTP_AS_CTRL_NS)), reg_tmp);

	if (to_cnt == OTP_RW_TO_CNT) {
		DBG_OTP_ERR("timeout!!!\n");
		to_cnt = OTP_RET_FAIL_FLG;
	} else {
		to_cnt = OTPStsSuccess;
	}

	/* restore access control selection */
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* In test chip, disable pwoer cut first then disable conroller,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(OTP_DEFAULT_PCEN_DLY);

	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
#else
	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#endif

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);
	return to_cnt;
}




/**
*  @brief Description of hal_rtl_otp_rd_sub_syss
*         hal_rtl_otp_rd_sub_syss is used for read sub looping function by SYSON-S
*
*  @param[in]  uint8_t pwr_cl_en: power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *rd_data:  read data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: read status, succeeded(0), failed(OTP_RET_FAIL_FLG and failed data number)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_sub_syss(uint8_t pwr_cl_en, uint32_t addr, uint8_t *rd_data, uint16_t len)
{
	uint32_t rd_cnt = 0;
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;

	for (rd_cnt = 0; rd_cnt < len; rd_cnt++) {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if ((pwr_cl_en != 0) || (rd_cnt == 0)) {
			DBG_OTP_INFO("enable power\n");
			/* Enable OTP memory power */
			hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif
		/* set mode/addr first */
		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_MODE_SEL);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_ADDR);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_DATA);
		HAL_SET_BIT(reg_tmp, (OTPRdMod << SYSON_S_SHIFT_OTP_MODE_SEL));
		HAL_SET_BIT(reg_tmp, (((addr + rd_cnt)& OTP_ADDR_MSK) << SYSON_S_SHIFT_OTP_ADDR));
		/* clear ready bit first */
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		DBG_OTP_INFO("to write AS_CTRL_NS: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);
		/* enable read operation */
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
		DBG_OTP_INFO("to write AS_CTRL_NS: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

		ret_val = 0;
		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		/* wait for operation done */
		while ((HAL_READ_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
			hal_delay_us(OTP_RD_CHK_INTV);
			reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
			DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
			ret_val++;
		}

		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		*(rd_data + rd_cnt) = reg_tmp & SYSON_MASK_OTP_DATA;
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

		if (ret_val == OTP_RW_TO_CNT) {
			DBG_OTP_ERR("timeout(%d)\n", rd_cnt);
			ret_val = OTP_RET_FAIL_FLG;
			ret_val |= rd_cnt;
		} else {
			ret_val = OTPStsSuccess;
		}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
		/**/
		if ((pwr_cl_en != 0) || (rd_cnt == len - 1) || ((ret_val & OTP_RET_FAIL_FLG) != 0)) {
			/* Disable OTP memory power */
			DBG_OTP_INFO("disable power\n");
			hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif
		if ((ret_val & OTP_RET_FAIL_FLG) != 0) {
			break;
		}
	}

