swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_rd_syss
*         hal_rtl_otp_rd_syss is used for read function by SYSON-S
*
*  @param[in]  uint8_t pwr_cl_en: power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *rd_data:  read data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: read status, succeeded(0), failed(OTP_RET_FAIL_FLG and failed data number)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_rd_syss(uint8_t pwr_cl_en, uint32_t addr, uint8_t *rd_data, uint16_t len)
{
	uint8_t as_ctrl_sel_bak;
	uint32_t ret_val = 0;

	DBG_OTP_INFO("%s>\n", __func__);
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);
	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif

	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_ctrl_sel(OTPCtrlSys);
	/* to do read operation*/
	ret_val = hal_rtl_otp_rd_sub_syss(pwr_cl_en, addr, rd_data, len);

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* In test chip, disable power cut first then disable conroller,
	   In MP chip, this flow should be revered. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);
#else
	if (OTP_ENABLE == pwr_cl_en) {
		/* Disable controller */
		hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

		/* Disable OTP memory power */
		DBG_OTP_INFO("disable power\n");
		hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
		hal_delay_us(_potp_adpt->pc_en_dly);

		/* Disable PMC control */
		hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);
	}
#endif
	DBG_OTP_INFO("%s<\n", __func__);
	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_byte_rd_syss
*         hal_rtl_otp_byte_rd_syss is used to read a single byte according to given address
*         by SYSON-S
*
*  @param[in]  uint32_t addr: OTP memory address
*
*  @returns uint8_t: read byte
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_byte_rd_syss(uint32_t addr)
{
	uint8_t rd_dat_tmp;
	hal_rtl_otp_rd_syss(OTP_ENABLE, addr, &rd_dat_tmp, 1);
	return rd_dat_tmp;
}

/**
*  @brief Description of hal_rtl_otp_wr_sub_syss
*         hal_rtl_otp_wr_sub_syss is used for write sub looping function by SYSON-S
*
*  @param[in]  uint8_t pwr_cl_en: power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *wr_data:  write data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: write operation status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_wr_sub_syss(uint8_t pwr_cl_en, uint32_t addr, uint8_t *wr_data, uint16_t len)
{
	uint32_t wr_cnt = 0;
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;

	for (wr_cnt = 0; wr_cnt < len; wr_cnt++) {
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if ((pwr_cl_en != 0) || (wr_cnt == 0)) {
			DBG_OTP_INFO("enable power\n");
			/* Enable OTP memory power */
			hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif
		/* enable grant for write operation */
		hal_rtl_otp_wr_gnt_ctrl(OTP_ENABLE);

		/* set mode/addr/data first */
		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_MODE_SEL);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_ADDR);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_DATA);
		HAL_SET_BIT(reg_tmp, (OTPWrMod << SYSON_S_SHIFT_OTP_MODE_SEL));
		HAL_SET_BIT(reg_tmp, (((addr + wr_cnt) & OTP_ADDR_MSK) << SYSON_S_SHIFT_OTP_ADDR));
		HAL_SET_BIT(reg_tmp, (*(wr_data + wr_cnt) << SYSON_S_SHIFT_OTP_DATA));
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		DBG_OTP_INFO("to write AS_CTRL_A: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);
		/* enable write operation */
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
		DBG_OTP_INFO("to write AS_CTRL_A: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);
		hal_delay_us(_potp_adpt->wr_dly);

		ret_val = 0;
		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
		/* wait for operation done */
		while ((HAL_READ_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
			hal_delay_us(OTP_WR_CHK_INTV);
			reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
			DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
			ret_val++;
		}

		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

		if (ret_val == OTP_RW_TO_CNT) {
			DBG_OTP_INFO("TO.(%d)\n", wr_cnt);
			ret_val = OTP_RET_FAIL_FLG;
			ret_val |= wr_cnt;
		} else {
			ret_val = OTPStsSuccess;
		}

		/* disable grant for write operation */
		hal_rtl_otp_wr_gnt_ctrl(OTP_DISABLE);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
		/**/
		if ((pwr_cl_en != 0) || (wr_cnt == len - 1) || ((ret_val & OTP_RET_FAIL_FLG) != 0)) {
			DBG_OTP_INFO("diable power\n");
			/* Disable OTP memory power */
			hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
			hal_delay_us(_potp_adpt->pc_en_dly);
		}
#endif

		if ((ret_val & OTP_RET_FAIL_FLG) != 0) {
			break;
		}
	}

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_wr_syss
*         hal_rtl_otp_wr_syss is used for write function by SYSON-S
*
*  @param[in]  uint8_t pwr_cl_en: power cycle in each loop control, 0: disable, 1:enable, power on/off each loop
*  @param[in]  uint32_t addr:     OTP memory address
*  @param[in]  uint8_t *wr_data:  write data buffer pointer
*  @param[in]  uint16_t len: read data length
*
*  @returns uint32_t: write operation status
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_wr_syss(uint8_t pwr_cl_en, uint32_t addr, uint8_t *wr_data, uint16_t len)
{
	uint8_t as_ctrl_sel_bak;
	uint32_t ret_val = 0;

	DBG_OTP_INFO("%s>\n", __func__);
	DBG_OTP_INFO("pc: %x, addr: %08x, data: %02x, len: %d\n", pwr_cl_en, addr, *wr_data, len);
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);

