swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
	DBG_OTP_INFO("disable power\n");
	/* Disable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
#else
	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#endif

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);
	return ret_val;
}


/**
*  @brief Description of hal_rtl_otp_al_ctrl_aon
*         hal_rtl_otp_al_ctrl_aon is used to control autoload enable/disable flow by SYSON-S
*
*  @param[in]  uint32_t al_en: autoload enable
*
*  @returns uint32_t: autoload flow succeeded(0) or failed(OTP_RET_FAIL_FLG)
*/
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_al_ctrl_syss(uint32_t al_en)
{
	uint8_t as_ctrl_sel_bak;
	uint32_t reg_tmp = 0;
	uint32_t to_cnt = 0;
	uint32_t al_cfg;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = 0;

	//hal_rtl_otp_ctrl_sel(OTPCtrlAon);
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);

	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);

	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#else
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif

	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();
	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	DBG_OTP_INFO("al_sts before enable: %08x\n", HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S))));
	/* set mode first */
	reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
	HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_ADDR);
	HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_DATA);
	HAL_SET_BIT(reg_tmp, (OTPALEnMod << SYSON_S_SHIFT_OTP_MODE_SEL));
	/* clear ready bit first */
	HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
	DBG_OTP_INFO("chk AS_SS: %08x\n", HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S))));
	DBG_OTP_INFO("wr to AS_SS: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);
	/* enable autoload operation */
	HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
	HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
	DBG_OTP_INFO("wr to AS_SS: %08x\n", reg_tmp);
	HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

	//hal_rtl_otp_ctrl_sel(OTPCtrlAon);
	to_cnt = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
	DBG_OTP_INFO("AL_STS: %08x\n", HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS))));
	al_cfg = (reg_tmp & (AON_BIT_OTP_AL_AON_EN | AON_BIT_OTP_AL_PON_EN | AON_BIT_OTP_AL_SYSON_EN));
	/* wait for autoload done */
	while (((reg_tmp & (al_cfg << AON_SHIFT_OTP_ALDN_AON_STS)) == 0) && (to_cnt < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AL_CTRL_STS)));
		DBG_OTP_INFO("AL_STS(%d): %08x\r\n", to_cnt, reg_tmp);
		to_cnt++;
	}

	//hal_rtl_otp_ctrl_sel(OTPCtrlSys);
	reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
	HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
	HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_MODE_SEL);
	HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
	HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

	if (to_cnt == OTP_RW_TO_CNT) {
		DBG_OTP_ERR("timeout!!!\n");
		to_cnt = OTP_RET_FAIL_FLG;
	} else {
		to_cnt = OTPStsSuccess;
	}

	/* restore access control selection */
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* In test chip, disable pwoer cut first then disable conroller,
	   In MP chip, this flow should be reversed. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(OTP_DEFAULT_PCEN_DLY);

	/* Disable PMC control */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);
#else
	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);
#endif
	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);
	return to_cnt;
}

/**
*  @brief Description of hal_rtl_otp_byte_wr_marr_aon
*         hal_rtl_otp_byte_wr_marr_aon is used to perform a byte write and then execute a program margin read for check
*
*  @param[in]  uint32_t addr: OTP memory address to be written
*  @param[in]  uint8_t wr_data: data to be written
*  @param[in]  uint8_t adj_vol: enable control to decide whether to adjust AON LDO voltage or not
*
*  @returns uint8_t: read result of program margin read
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_byte_wr_marr_aon(uint32_t addr, uint8_t wr_data, uint8_t adj_vol)
{
	uint8_t ret_val = 0xFF;
	uint32_t otp_tmp_val;
	uint32_t otp_aon_ldo_bak;
	uint32_t otp_aon_ldo_adj;
	uint8_t as_ctrl_sel_bak;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_wr_aon(OTP_DISABLE, addr, &wr_data, 1);

	/* set control sel to AON*/
	hal_rtl_otp_ctrl_sel(OTPCtrlAon);

	/* Adjust AON LDO voltage */
	if (OTP_DISABLE != adj_vol) {
		otp_aon_ldo_bak = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)));
		otp_aon_ldo_adj = otp_aon_ldo_bak & 0xFFFFFF0F;
		if (0xFF != otp_adj_vol_lvl) {
			otp_aon_ldo_adj = otp_aon_ldo_adj | ((otp_adj_vol_lvl & 0x0F) << AON_SHIFT_LDOH09_V09ADJ_L_3_0);
			HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)), otp_aon_ldo_adj);
		}

		hal_delay_us(_potp_adpt->pc_en_dly);
	}

