swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	DBG_OTP_INFO("set pg margin read\n");
	hal_rtl_otp_test_mod_cfg(OTPPgMarRdMod);


	otp_tmp_val = hal_rtl_otp_rd_sub_aon(OTP_DISABLE, addr, &ret_val, 1);
	if (OTP_RET_FAIL_FLG == otp_tmp_val) {
		DBG_OTP_ERR("PG margin read error\n");
		ret_val = 0xFF;
	}

	DBG_OTP_INFO("pg margin read data: %x\n", ret_val);
	DBG_OTP_INFO("set user read\n");
	hal_rtl_otp_test_mod_cfg(OTPTestUserMOd);

	/* restore AON LDO voltage */
	if (OTP_DISABLE != adj_vol) {
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)), otp_aon_ldo_bak);
		hal_delay_us(_potp_adpt->pc_en_dly);
	}

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_byte_wr_marr_sys
*         hal_rtl_otp_byte_wr_marr_sys is used to perform a byte write and then execute a program margin read for check
*
*  @param[in]  uint32_t addr: OTP memory address to be written
*  @param[in]  uint8_t wr_data: data to be written
*  @param[in]  uint8_t adj_vol: enable control to decide whether to adjust AON LDO voltage or not
*
*  @returns uint8_t: read result of program margin read
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_byte_wr_marr_sys(uint32_t addr, uint8_t wr_data, uint8_t adj_vol)
{
	uint8_t ret_val = 0xFF;
	uint32_t otp_tmp_val;
	uint32_t otp_aon_ldo_bak;
	uint32_t otp_aon_ldo_adj;
	uint8_t as_ctrl_sel_bak;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_wr_sys(OTP_DISABLE, addr, &wr_data, 1);

	/* set control sel to AON*/
	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	/* Adjust AON LDO voltage */
	if (OTP_DISABLE != adj_vol) {
		otp_aon_ldo_bak = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)));
		otp_aon_ldo_adj = otp_aon_ldo_bak & 0xFFFFFF0F;
		if (0xFF != otp_adj_vol_lvl) {
			otp_aon_ldo_adj = otp_aon_ldo_adj | ((otp_adj_vol_lvl & 0x0F) << AON_SHIFT_LDOH09_V09ADJ_L_3_0);
			HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)), otp_aon_ldo_adj);
		}

		hal_delay_us(_potp_adpt->pc_en_dly);
	}

	DBG_OTP_INFO("set pg margin read\n");
	hal_rtl_otp_test_mod_cfg(OTPPgMarRdMod);


	otp_tmp_val = hal_rtl_otp_rd_sub_sys(OTP_DISABLE, addr, &ret_val, 1);
	if (OTP_RET_FAIL_FLG == otp_tmp_val) {
		DBG_OTP_ERR("PG margin read error\n");
		ret_val = 0xFF;
	}

	DBG_OTP_INFO("pg margin read data: %x\n", ret_val);
	DBG_OTP_INFO("set user read\n");
	hal_rtl_otp_test_mod_cfg(OTPTestUserMOd);

	/* restore AON LDO voltage */
	if (OTP_DISABLE != adj_vol) {
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)), otp_aon_ldo_bak);
		hal_delay_us(_potp_adpt->pc_en_dly);
	}

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_byte_wr_marr_syss
*         hal_rtl_otp_byte_wr_marr_syss is used to perform a byte write and then execute a program margin read for check
*
*  @param[in]  uint32_t addr: OTP memory address to be written
*  @param[in]  uint8_t wr_data: data to be written
*  @param[in]  uint8_t adj_vol: enable control to decide whether to adjust AON LDO voltage or not
*
*  @returns uint8_t: read result of program margin read
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_byte_wr_marr_syss(uint32_t addr, uint8_t wr_data, uint8_t adj_vol)
{
	uint8_t ret_val = 0xFF;
	uint32_t otp_tmp_val;
	uint32_t otp_aon_ldo_bak;
	uint32_t otp_aon_ldo_adj;
	uint8_t as_ctrl_sel_bak;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_wr_syss(OTP_DISABLE, addr, &wr_data, 1);

	/* set control sel to AON*/
	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	/* Adjust AON LDO voltage */
	if (OTP_DISABLE != adj_vol) {
		otp_aon_ldo_bak = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)));
		otp_aon_ldo_adj = otp_aon_ldo_bak & 0xFFFFFF0F;
		if (0xFF != otp_adj_vol_lvl) {
			otp_aon_ldo_adj = otp_aon_ldo_adj | ((otp_adj_vol_lvl & 0x0F) << AON_SHIFT_LDOH09_V09ADJ_L_3_0);
			HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)), otp_aon_ldo_adj);
		}

		hal_delay_us(_potp_adpt->pc_en_dly);
	}

	DBG_OTP_INFO("set pg margin read\n");
	hal_rtl_otp_test_mod_cfg(OTPPgMarRdMod);


	otp_tmp_val = hal_rtl_otp_rd_sub_syss(OTP_DISABLE, addr, &ret_val, 1);
	if (OTP_RET_FAIL_FLG == otp_tmp_val) {
		DBG_OTP_ERR("PG margin read error\n");
		ret_val = 0xFF;
	}

	DBG_OTP_INFO("pg margin read data: %x\n", ret_val);
	DBG_OTP_INFO("set user read\n");
	hal_rtl_otp_test_mod_cfg(OTPTestUserMOd);

	/* restore AON LDO voltage */
	if (OTP_DISABLE != adj_vol) {
		HAL_WRITE32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_AON_LDO_CTRL0)), otp_aon_ldo_bak);
		hal_delay_us(_potp_adpt->pc_en_dly);
	}

	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	/* Disable controller */
	hal_rtl_otpc_ctrl(OTP_DISABLE, OTP_DISABLE, OTP_DISABLE);

	/* Disable OTP memory power */
	DBG_OTP_INFO("disable power\n");
	hal_rtl_otp_pwr_ctrl(OTP_DISABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Disable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_DISABLE);

	DBG_OTP_INFO("%s<\n", __func__);

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_rp_mar_rd_aon
*         hal_rtl_otp_rp_mar_rd_aon is used to perform a repair margin read operation
*
*  @returns uint8_t: status of repair margin read
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_rp_mar_rd_syss(uint8_t auto_en)
{
	uint8_t as_ctrl_sel_bak;
	uint8_t ret_val = 0;
	uint32_t tmp_addr;
	uint32_t reg_tmp;

	DBG_OTP_INFO("%s>\n", __func__);
#if 0
	/* Enable PMC control */
	hal_rtl_otp_pmc_gnt_ctrl(OTP_ENABLE);

