swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_otp.c
	/* In test chip, enable controller first then enable pwoer cut,
	   In MP chip, this flow should be reversed. */
	DBG_OTP_INFO("enable power\n");
	/* Enable OTP memory power */
	hal_rtl_otp_pwr_ctrl(OTP_ENABLE);
	hal_delay_us(_potp_adpt->pc_en_dly);

	/* Enable controller */
	hal_rtl_otpc_ctrl(OTP_ENABLE, OTP_ENABLE, OTP_ENABLE);
#endif
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	DBG_OTP_INFO("set auto repair margin read, auto_en: %x\n", auto_en);
	if (OTP_ENABLE == auto_en) {
		hal_rtl_otp_test_mod_cfg(OTPAutoRpMarRdMOd);
	} else {
		hal_rtl_otp_test_mod_cfg(OTPRpMarRdMOd);
	}

#if 0
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	/* wait for operation done */
	while ((HAL_READ_BIT(reg_tmp, AON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
		ret_val++;
	}
	DBG_OTP_INFO("ready\r\n");
#endif

	DBG_OTP_INFO("to do normal read\r\n");
	for (tmp_addr = 0; tmp_addr < OTP_MEM_SIZE; tmp_addr++) {

		/* set mode/addr first */
		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_MODE_SEL);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_ADDR);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_MASK_OTP_DATA);
		HAL_SET_BIT(reg_tmp, (OTPRdMod << SYSON_S_SHIFT_OTP_MODE_SEL));
		HAL_SET_BIT(reg_tmp, ((tmp_addr & OTP_ADDR_MSK) << SYSON_S_SHIFT_OTP_ADDR));
		/* clear ready bit first */
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		DBG_OTP_INFO("to write AS_CTRL_NS: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

		/* enable read operation */
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
		DBG_OTP_INFO("to write AS_CTRL_NS: %08x\n", reg_tmp);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

		ret_val = 0;
		reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
		/* wait for operation done */
		while ((HAL_READ_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
			hal_delay_us(OTP_RD_CHK_INTV);
			reg_tmp = HAL_READ32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)));
			DBG_OTP_INFO("reg_tmp: %08x\r\n", reg_tmp);
			ret_val++;
		}

		HAL_SET_BIT(reg_tmp, SYSON_S_BIT_OTP_RDY);
		HAL_CLEAR_BIT(reg_tmp, SYSON_S_BIT_OTP_OP_EN);
		HAL_WRITE32(SYSON_S_BASE, (uint32_t)(&(SYSON_S_BASE_REG->SYSON_S_REG_OTP_AS_CTRL_S)), reg_tmp);

		if (ret_val == OTP_RW_TO_CNT) {
			DBG_OTP_ERR("TO.(%d)\n", tmp_addr);
			ret_val = OTPStsFailed;
			break;
		} else {
			DBG_OTP_INFO("ready\r\n");
			ret_val = OTPStsSuccess;
		}

		if (OTP_ENABLE == auto_en) {
			break;
		}
	}

	DBG_OTP_INFO("set user read\n");
	hal_rtl_otp_test_mod_cfg(OTPTestUserMOd);
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	DBG_OTP_INFO("%s<\n", __func__);

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_rp_chk_aon
*         hal_rtl_otp_rp_chk_aon is used to perform repair check by AON register
*
*  @returns uint8_t: read result of repair check
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_rp_chk_syss(void)
{
	uint8_t as_ctrl_sel_bak;
	uint8_t ret_val = 0;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	DBG_OTP_INFO("set repair check\n");
	hal_rtl_otp_test_mod_cfg(OTPRpChkMod);

	ret_val = 0;
	hal_rtl_otp_rd_sub_syss(OTP_DISABLE, 0, &ret_val, 1);

	DBG_OTP_INFO("set user read\n");
	hal_rtl_otp_test_mod_cfg(OTPTestUserMOd);
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	DBG_OTP_INFO("%s<\n", __func__);

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_rp_pg_aon
*         hal_rtl_otp_rp_pg_aon is used to perform repair program
*
*  @returns uint8_t: read result of repair program
*/
SECTION_OTP_TEXT
uint8_t hal_rtl_otp_rp_pg_syss(void)
{
	uint8_t as_ctrl_sel_bak;
	uint8_t ret_val = 0;
	uint32_t tmp_addr;
	uint32_t reg_tmp;

	DBG_OTP_INFO("%s>\n", __func__);
	as_ctrl_sel_bak = hal_rtl_otp_ctrl_sel_sts();

	hal_rtl_otp_ctrl_sel(OTPCtrlSys);

	DBG_OTP_INFO("set repair program\n");
	hal_rtl_otp_test_mod_cfg(OTPRpPgMod);

	ret_val = 0;
	hal_rtl_otp_wr_sub_syss(OTP_DISABLE, 0, &ret_val, 1);

	DBG_OTP_INFO("set user read\n");
	hal_rtl_otp_test_mod_cfg(OTPTestUserMOd);
	hal_rtl_otp_ctrl_sel(as_ctrl_sel_bak);

	DBG_OTP_INFO("%s<\n", __func__);

	return ret_val;
}

/**
*  @brief Description of hal_rtl_otp_set_aon_vol
*         hal_rtl_otp_set_aon_vol is used to set AON LDO voltage
*
*  @param[in]  uint8_t aon_vol: target AON LDO voltage
*/
SECTION_OTP_TEXT
void hal_rtl_otp_set_aon_vol(uint8_t aon_vol)
{
	otp_adj_vol_lvl = aon_vol;
	DBG_OTP_INFO("AON vol: %x\n", otp_adj_vol_lvl);
}


#if 0
SECTION_OTP_TEXT
uint32_t hal_rtl_otp_chk_rdy_sts(void)
{
	uint32_t reg_tmp = 0;
	uint32_t ret_val = 0;

	ret_val = 0;
	reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
	/* wait for OTP ready status */
	while ((HAL_READ_BIT(reg_tmp, AON_BIT_OTP_RDY) == 0) && (ret_val < OTP_RW_TO_CNT)) {
		hal_delay_us(OTP_RD_CHK_INTV);
		reg_tmp = HAL_READ32(AON_BASE, (uint32_t)(&(AON_BASE_REG->AON_REG_OTP_AS_CTRL_A)));
		ret_val++;
	}

	if (OTP_RW_TO_CNT == ret_val) {
		ret_val = OTPStsFailed;
	} else {
		ret_val = OTPStsSuccess;
	}

	return ret_val;
}
#endif
#endif // end of "#if CONFIG_UART_EN"

